In [1]:
#pip install pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [4]:
#pip install --upgrade pandas

## ***SERIES***

In [5]:
s1=pd.Series(['kamali','khathija','puthumalar','viji','thanigai','balj'],index=[1,2,3,4,5,6])

In [6]:
print(s1)

1        kamali
2      khathija
3    puthumalar
4          viji
5      thanigai
6          balj
dtype: object

## ***DATA FRAME***

variable_name=pd.DataFrame(data,column=[column name])

In [7]:
s2=pd.Series(['kamali','khathija','Afra','Pratheeba','pudhu',],index=[1,2,3,4,5])

In [8]:
s2

1       kamali
2     khathija
3         Afra
4    Pratheeba
5        pudhu
dtype: object

In [23]:
s3=pd.Series(['No','No','Yes','yes','yes'],index=[1,2,3,4,5])

In [24]:
s3

1     No
2     No
3    Yes
4    yes
5    yes
dtype: object

In [25]:
DF1=pd.DataFrame(s2,columns=['Name'])

In [26]:
DF1

        Name
1     kamali
2   khathija
3       Afra
4  Pratheeba
5      pudhu

In [31]:
DF1["C"]=s3

In [32]:
DF1

        Name    C
1     kamali   No
2   khathija   No
3       Afra  Yes
4  Pratheeba  yes
5      pudhu  yes

In [38]:
Fruits={"seed":{1:"Orange",2:"Apple",3:"watermelon"},"Seedless":{1:"Grapes",2:"PineApple",3:"Papaya"}}

In [41]:
df2=pd.DataFrame(Fruits,columns=["seed","Seedless"])

In [42]:
df2

         seed   Seedless
1      Orange     Grapes
2       Apple  PineApple
3  watermelon     Papaya

### ***TASK 01***

Create a dataframe for your class ,containing "Name","Reg No","Year of study" as column names for 05 students

In [57]:
Students={"Name":{1:"Kamali",2:"Khathija",3:"Pudhumalar",4:"Pratheeba",5:"Afra",6:"Viji"},"Reg No":{1:"122011012803",2:"122011012817",3:"122011012820",4:"122011012821",5:"122011012840",6:"122011012836"},   "Year of Study":{1:"IIIYr",2:"IIIYr",3:"IIIYr",4:"IIIYr",5:"IIIYr",6:"IIIYr"}}

In [59]:
df3=pd.DataFrame(Students,columns=["Name","Reg No","Year of Study"])

In [60]:
df3

         Name        Reg No Year of Study
1      Kamali  122011012803         IIIYr
2    Khathija  122011012817         IIIYr
3  Pudhumalar  122011012820         IIIYr
4   Pratheeba  122011012821         IIIYr
5        Afra  122011012840         IIIYr
6        Viji  122011012836         IIIYr

In [61]:
df2.drop(1,axis=0)

         seed   Seedless
2       Apple  PineApple
3  watermelon     Papaya

In [62]:
df2.drop(2,axis=0)

         seed Seedless
1      Orange   Grapes
3  watermelon   Papaya